

package com.lj.eshop.emus;

/**
 * Copyright &copy; 2017-2020  All rights reserved.
 *
 * Licensed under the 深圳市领居科技 License, Version 1.0 (the "License");
 * 
 */

/**
 * 
 * 
 * 类说明：银行编码
 *  
 * 
 * <p>
 * 详细描述：
 *   
 * @Company: 领居科技有限公司
 * @author 段志鹏
 *   
 * CreateDate: 2017年8月25日
 */
public enum BankCode {

	/**
	 * 中国工商银行
	 */
	ICBC("工商银行"),
	
	/**
	 * 招商银行
	 */
	CMB("招商银行"),
	
	/**
	 * 民生银行
	 */
	CMBC("民生银行"),
	
	/**
	 * 中国建设银行
	 */
	CCB("建设银行"),
	
	/**
	 * 中国银行
	 */
	BOC("中国银行"),
	
	/**
	 * 中国人民银行
	 */
	PBC("中国人民银行"),
	
	/**
	 * 中国农业银行
	 */
	ABC("农业银行"),
	
	/**
	 * 平安银行
	 */
	PAB("平安银行"),
	
	/**
	 * 平安付
	 */
	PAPAY("平安付"),
	
	/**
	 * 交通银行
	 */
	BOCM("交通银行"),
	
	/**
	 * 中国光大银行
	 */
	CEB("光大银行"),
	
	/**
	 * 中信银行
	 */
	CITIC("中信银行"),
	
	/**
	 * 广东发展银行
	 */
	CGB("广发银行"),
	
	/**
	 * 北京银行
	 */
	BOB("北京银行"),
	
	/**
	 * 上海浦东发展银行
	 */
	SPDB("浦发银行"),
	
	/**
	 * 中国邮政银行
	 */
	PSBC("邮政银行"),
	
	/**
	 * 兴业银行
	 */
	CIB("兴业银行"),
	
	/**
	 * 深圳发展银行
	 */
	SDB("深圳发展银行"),
	
	/**
	 * 国家开发银行
	 */
	CDB("国家开发银行"),
	
	/**
	 * 汇丰银行
	 */
	HSBC("汇丰银行"),
	
	/**
	 * 华夏银行
	 */
	HXB("华夏银行"),
	
	/**
	 * 中国进出口银行
	 */
	EIBC("中国进出口银行"),
	
	/**
	 * 中国农业发展银行
	 */
	ADBC("中国农业发展银行"),
	
	/**
	 * 支付宝
	 */
	ALIPAY("支付宝"),
	
	/**
	 * 微信支付
	 */
	WEIXIN("微信支付"),
	
	/**
	 * 易宝支付
	 */
	YEEPAY("易宝支付"),
	
	/**
	 * 腾付通
	 */
	TFTPAY("腾付通"),
	
	/**
	 * 银盛支付
	 */
	YSEPAY("银盛支付"),
	
	/**
	 * 中金支付
	 */
	ZJPAY("中金支付"),
	
	/**
	 * 银联在线
	 */
	UPOP("银联在线"),
	
	/**
	 * 银联
	 */
	UNIONPAY("银联"),
	
	
	EBCL("恒丰银行"),
	LYCB("临沂商业银行"),
	CZSB("浙商银行"),
	BOHC("渤海银行"),
	CTSH("花旗银行(中国)有限公司"),
	BEAI("东亚银行中国有限公司"),
	SCB("渣打银行中国有限公司"),
	DBSC("星展银行"),
	HSSH("恒生银行"),
	WB("友利银行(中国)有限公司"),
	SHBC("新韩银行"),
	HNBK("韩亚银行（中国）"),
	OCBS("华侨银行（中国）"), 
	WHBC("永亨银行（中国）有限公司"),
	NCBC("南洋商业银行（中国）"),
	SG("法国兴业银行（中国）"),
	UOBS("大华银行（中国）"), 
	DSSZ("大新银行（中国）"), 
	IBK("企业银行（中国）"),
	BKSH("上海银行"),
	XMB("厦门银行股份有限公司"),
	FJHXB("福建海峡银行股份有限公司"),
	JLB("吉林银行"),
	ZJCB("镇江市商业银行"),
	BONB("宁波银行"),
	JZCB("焦作市商业银行"),
	WZB("温州银行"),
	BOGZ("广州银行股份有限公司"),
	HKB("汉口银行"),
	LJB("龙江银行股份有限公司"),
	SJB("盛京银行"),
	BOLY("洛阳银行"),
	LYB("辽阳银行股份有限公司"),
	DLB("大连银行"),
	SZCB("苏州市商业银行"),
	BOHB("河北银行股份有限公司"),
	HZCCB("杭州商业银行"),
	NJB("南京银行"),
	DGCB("东莞市商业银行"),
	JHB("金华银行股份有限公司"),
	UQCB("乌鲁木齐市商业银行"),
	SXB("绍兴银行股份有限公司"),
	CDCCB("成都商业银行"),
	FSB("抚顺银行股份有限公司"),
	YCCCB("宜昌市商业银行"),
	HLDCB("葫芦岛市商业银行"),
	TJCB("天津市商业银行"),
	ZZB("郑州银行股份有限公司"),
	NXB("宁夏银行"),
	ZHHRB("珠海华润银行股份有限公司"),
	QSB("齐商银行"),
	BOJZ("锦州银行股份有限公司"),
	HSHB("徽商银行"),
	CQB("重庆银行"),
	HRBB("哈尔滨银行"),
	GYB("贵阳银行股份有限公司"),
	XAB("西安银行股份有限公司"),
	WXCB("无锡市商业银行"),
	DDB("丹东银行股份有限公司"),
	BOLZ("兰州银行"),
	BONC("南昌银行"),
	JSB("晋商银行"),
	QDB("青岛银行"),
	JLCB("吉林市商业银行"),
	NTCB("南通商业银行"),
	JJB("九江银行股份有限公司"),
	ASB("鞍山银行"),
	QHDCB("秦皇岛市商业银行"),
	QHB("青海银行"),
	TZB("台州银行"),
	YCCB("盐城商行"),
	CSB("长沙银行股份有限公司"),
	GZB("赣州银行股份有限公司"),
	QZB("泉州银行"),
	YKCB("营口市商业银行"),
	KMCB("昆明商业银行"),
	FXB("阜新银行股份有限公司"),
	JXCB("嘉兴市商业银行"),
	LFB("廊坊银行"),
	TLCB("泰隆城市信用社"),
	IMB("内蒙古银行"),
	HZCB("湖州市商业银行"),
	CZB("沧州银行"),
	NNCB("南宁市商业银行"),
	BSB("包商银行"),
	LYGCB("连云港市商业银行"),
	WHCB("威海商业银行"),
	PZHCB("攀枝花市商业银行"),
	MYCB("绵阳市商业银行"),
	LZCB("泸州市商业银行"),
	DTCB("大同市商业银行"),
	SMXB("三门峡银行"),
	GDNYB("广东南粤银行"),
	ZJKCB("张家口市商业银行"),
	GLCB("桂林市商业银行"),
	JSCJCB("江苏长江商业银行"),
	XZCB("徐州市商业银行"),
	LZB("柳州银行股份有限公司"),
	NCCB("南充市商业银行"),
	LWB("莱芜银行"),
	BODY("德阳银行"),
	TSCB("唐山市商业银行"),
	LPSCB("六盘水商行"),
	QJCB("曲靖市商业银行"),
	JCB("晋城银行股份有限公司"),
	BOJS("江苏银行"),
	CZCB("长治市商业银行"),
	CDCB("承德市商业银行"),
	DZB("德州银行"),
	ZYCB("遵义市商业银行"),
	HDCB("邯郸市商业银行"),
	ASCB("安顺市商业银行"),
	PLCB("平凉市商业银行"),
	YXCB("玉溪市商业银行"),
	ZJMTCB("浙江民泰商业银行"),
	SRCCB("上饶市商业银行"),
	DYB("东营银行"),
	TACB("泰安市商业银行"),
	ZJCZCB("浙江稠州商业银行"),
	BOWH("乌海银行股份有限公司"),
	ZGCB("自贡市商业银行"),
	EEDSB("鄂尔多斯银行"),
	HBB("鹤壁银行"),
	XCCB("许昌市商业银行"),
	JNB("济宁银行股份有限公司"),
	TLB("铁岭银行"),
	LSCB("乐山市商业银行"),
	CAB("长安银行"),
	CQSXB("重庆三峡银行"),
	SZSB("石嘴山银行"),
	PJCB("盘锦市商业银行"),
	KLB("昆仑银行股份有限公司"),
	PDSB("平顶山银行股份有限公司"),
	CYB("朝阳银行"),
	NBDHB("宁波东海银行"),
	SNCB("遂宁市商业银行"),
	BDB("保定银行"),
	XTB("邢台银行股份有限公司"),
	LSZCB("凉山州商业银行"),
	LHCB("漯河商行"),
	DZCB("达州市商业银行"),
	XXCB("新乡市商业银行"),
	JZB("晋中市商业银行"),
	ZMDCB("驻马店市商业银行"),
	HSCB("衡水市商业银行"),
	ZKB("周口银行"),
	YQCB("阳泉市商业银行"),
	YBCB("宜宾市商业银行"),
	KELCB("库尔勒市商业银行"),
	YACB("雅安市商业银行"),
	SQCB("商丘商行"),
	AYB("安阳银行"),
	XYB("信阳银行"),
	HRXJB("华融湘江银行"),
	YKYHB("营口沿海银行"),
	JDZCB("景德镇商业银行"),
	HBBCL("湖北银行"),
	XJHHB("新疆汇和银行"),
	GDHXB("广东华兴银行"),
	PYB("濮阳银行"),
	SHRCC("上海农信"),
	KSRCC("昆山农信社"),
	CSRCB("常熟市农村商业银行"),
	SZRCB("深圳农村商业银行"),
	GZRCB("广州农村商业银行"),
	NHRCB("广东南海农村商业银行"),
	SDRCB("佛山顺德农村商业银行"),
	KMRCC("昆明农联社"),
	HBRCC("湖北农信"),
	XZRCC("徐州市郊农村信用合作联社"),
	JYRCB("江阴市农村商业银行"),
	CQRCB("重庆农村商业银行"),
	SDRCC("山东省农村信用社联合社"),
	DGRCB("东莞农村商业银行"),
	ZJGRCB("张家港农村商业银行"),
	FJRCC("福建省农村信用社联合社"),
	BJRCB("北京农村商业银行"),
	TJRCB("天津农村商业银行"),
	YZRCB("宁波鄞州农村合作银行"),
	SSRCC("佛山市三水区农村信用合作社"),
	CDRCB("成都农村商业银行"),
	JSRCC("江苏省农村信用社联合社"),
	XHRCC("江门新会农村商业银行"),
	WJRCB("吴江农商行"),
	ZJRCC("浙江省农村信用社联合社"),
	SZB("苏州银行股份有限公司"),
	ZHRCB("珠海农村商业银行"),
	TCRCB("太仓农村商业银行"),
	YDRCC("尧都区农村信用合作社联社"),
	GZRCC("贵州省农村信用社联合社"),
	WXRCB("无锡农村商业银行"),
	HNRCC("湖南省农村信用社联合社"),
	JXRCC("江西省农村信用社联合社"),
	HNRCU("河南省农村信用社联合社"),
	RCCOHB("河北省农村信用社联合社"),
	SXRCCU("陕西省农村信用社联合社"),
	GXRCC("广西农村信用社联合社"),
	WWERCC("新疆维吾尔自治区农村信用社联合"),
	JLRCC("吉林农信联合社"),
	HHRCB("黄河农村商业银行"),
	AHRCC("安徽省农村信用社联合社"),
	HNB("海南省农村信用社联合社"),
	QHRCC("青海省农村信用社联合社"),
	GDRCC("广东省农村信用社联合社"),
	IMLRCC("内蒙古自治区农村信用社联合式"),
	SCRCC("四川省农村信用社联合社"),
	GSRCC("甘肃省农村信用社联合社"),
	LNRCC("辽宁省农村信用社联合社"),
	SXRCU("山西省农村信用社联合社"),
	BHRCB("天津滨海农村商业银行"),
	HLJRCC("黑龙江省农村信用社联合社"),
	WHRCB("武汉农村商业银行"),
	JNRCB("江南农村商业银行"),
	DYJYXMRB("大邑交银兴民村镇银行"),
	JYWJRB("湖北嘉鱼吴江村镇银行"),
	XTBNSRB("湖北仙桃北农商村镇银行"),
	SNRB("海口苏南村镇银行"),
	JOSSRB("福建建瓯石狮村镇银行"),
	ESCNSRB("恩施常农商村镇银行"),
	CXURB("浙江长兴联合村镇银行"),
	PHGYRB("浙江平湖工银村镇银行"),
	MYHFRB("北京密云汇丰村镇银行"),
	SYDWRB("江苏沭阳东吴村镇银行"),
	DSMYRB("鄂尔多斯市东胜蒙银村镇银行"),
	ZSXLRB("中山小榄村镇银行"),
	HJMTRB("江苏邗江民泰村镇银行"),
	DTXHRB("安徽当涂新华村镇银行"),
	GCZYDFRB("谷城中银富登村镇银行"),
	SYYZRB("北京顺义银座村镇银行"),
	BQRXRB("拜泉融兴村镇银行"),
	NYRB("南阳村镇银行"),
	SJMSRB("上海松江民生村镇银行"),
	HSRB("浙江建德湖商村镇银行"),
	YCRXCB("晋中市榆次融信村镇银行"),
	BSCB("宝生村镇银行"),
	GZHDCZRB("广州花都稠州村镇银行"),
	QHGMRB("琼海国民村镇银行"),
	HSZJRB("鹤山珠江村镇银行"),
	DWKSYRB("大武口石银村镇银行"),
	KSLCCB("昆山鹿城村镇银行"),
	DYLSCB("东营莱商村镇银行"),
	GZZCCJRB("广州增城长江村镇银行"),
	CSXSRB("长沙星沙沪农商村镇银行"),
	BEA("东亚银行有限公司"),
	CB("花旗银行有限公司"),
	DSB("大新银行有限公司"),
	WHB("永亨银行"),
	CCBA("中国建设银行亚洲股份有限公司"),
	DBS("星展银行香港有限公司"),
	SHCB("上海商业银行"),
	WLB("永隆银行有限公司"),
	HSB("恒生银行有限公司"),
	CITICI("中信嘉华银行有限公司"),
	CHB("创兴银行有限公司"),
	BOCCC("中银信用卡(国际)有限公司"),
	BOCHK("中国银行（香港）"),
	NCB("南洋商业银行"),
	CBCL("集友银行"),
	AEON("AEON信贷财务亚洲有限公司"),
	BTF("澳门大丰银行"),
	CCBMC("中国建设银行澳门股份有限公司"),
	SCBHK("渣打银行香港有限公司"),
	CYS("中国银盛"),
	LIBL("澳门国际银行"),
	BNU("大西洋银行股份有限公司"),
	BCM("澳门商业银行"),
	ICBCM("中国工商银行（澳门）"),
	EPC("中银通商务支付有限公司"),
	PSBCCC("中国邮政储蓄银行信用卡中心"),
	CITICCC("中信银行信用卡中心"),
	SPDBCC("浦发银行信用卡中心"),
	QLB("齐鲁银行股份有限公司"),
	LSB("临商银行"),
	HRBCB("哈尔滨商行"),
	RZB("日照银行"),
	WFB("潍坊银行"),
	FDB("富滇银行"),
	ZJTLCB("浙江泰隆商业银行"),
	HZB("湖州银行"),
	GXBBGB("广西北部湾银行"),
	GLB("桂林银行"),
	SRCB("上海农村商业银行"),
	YNRCC("云南省农村信用社"),
	BOCD("承德银行"),
	SRB("上饶银行");
	
	private String text;
	
	private BankCode(String text) {
		this.text = text;
	}
	
	public String getText(){
		return this.text;
	}
}

